---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainSystemHostInvisible
source: html/709d37cc-3a03-7acd-26cd-9906ae318371.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainSystemHostInvisible Property

Element defining the Curtain System is invisible in the current view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurtainSystemHostInvisible { get; }
```